// pages/about/about.js
Page({

      /**
       * 页面的初始数据
       */
      data: {
        des:'背景：\n随着人们节约环保的消费意识的增强，以及“共享经济”的逐渐流行，在商品极大丰富的大学校园里，二手物品交易市场迅速发展。大学生的消费金额限制、其节约意识以及每年大量的新生入学和毕业生离校，给予大学二手交易市场巨大的发展空间。然而我们观察发现，当前校园内的二手交易市场缺乏系统的管理方法，也缺少一个可靠实用的校园交易平台。考虑到微信小程序，方便快捷即用即走，速度快，安全性强以及开发成本低等的优点，我们选择它作为交易平台。\n\n注意：\n本微信小程序只是提供物品交易的平台，不涉及金钱交易！主要服务于大学校园的学生与教师。\n',
        con:'如有相关意见或建议，请联系我们\n\nQQ群：953286764\n'
      },

      /**
       * 生命周期函数--监听页面加载
       */
      onLoad: function (options) {

      },

      onReady: function () {

      },
      /**
       * 生命周期函数--监听页面显示
       */
      onShow: function () {

      },

      /**
       * 生命周期函数--监听页面隐藏
       */
      onHide: function () {

      },

      /**
       * 生命周期函数--监听页面卸载
       */
      onUnload: function () {

      },

      /**
       * 页面相关事件处理函数--监听用户下拉动作
       */
      onPullDownRefresh: function () {

      },

      /**
       * 页面上拉触底事件的处理函数
       */
      onReachBottom: function () {

      },

      /**
       * 用户点击右上角分享
       */
      onShareAppMessage: function () {

      }
})
